experiment/results/no_istio_20260105_141518/wrk_logs/wrk_5000rps_rep1.log
Running 2m test @ http://localhost:31643
  4 threads and 100 connections

  Thread calibration: mean lat.: 2665.829ms, rate sampling interval: 9510ms
  Thread calibration: mean lat.: 2555.956ms, rate sampling interval: 9453ms
  Thread calibration: mean lat.: 2623.480ms, rate sampling interval: 9650ms
  Thread calibration: mean lat.: 2607.110ms, rate sampling interval: 9486ms

-----------------------------------------------------------------------
Test Results @ http://localhost:31643 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.74s    16.57s    1.04m    58.00%
    Req/Sec   602.39      9.39   630.00     72.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.82s 
 75.000%   48.01s 
 90.000%    0.94m 
 99.000%    1.04m 
 99.900%    1.08m 
 99.990%    1.09m 
 99.999%    1.10m 
100.000%    1.11m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3463.167     0.000000            1         1.00
   10739.711     0.100000        26521         1.11
   16572.415     0.200000        53025         1.25
   22151.167     0.300000        79492         1.43
   28082.175     0.400000       106040         1.67
   33816.575     0.500000       132496         2.00
   36667.391     0.550000       145808         2.22
   39452.671     0.600000       159007         2.50
   42401.791     0.650000       172312         2.86
   45187.071     0.700000       185536         3.33
   48005.119     0.750000       198780         4.00
   49381.375     0.775000       205443         4.44
   50855.935     0.800000       212058         5.00
   52297.727     0.825000       218630         5.71
   53772.287     0.850000       225232         6.67
   55214.079     0.875000       231878         8.00
   55869.439     0.887500       235200         8.89
   56623.103     0.900000       238503        10.00
   57376.767     0.912500       241877        11.43
   58064.895     0.925000       245087        13.33
   58818.559     0.937500       248502        16.00
   59146.239     0.943750       250075        17.78
   59539.455     0.950000       251747        20.00
   59932.671     0.956250       253421        22.86
   60293.119     0.962500       255111        26.67
   60686.335     0.968750       256682        32.00
   60915.711     0.971875       257556        35.56
   61145.087     0.975000       258427        40.00
   61374.463     0.978125       259206        45.71
   61636.607     0.981250       260029        53.33
   61931.519     0.984375       260873        64.00
   62095.359     0.985938       261228        71.11
   62259.199     0.987500       261638        80.00
   62455.807     0.989062       262098        91.43
   62619.647     0.990625       262472       106.67
   62881.791     0.992188       262896       128.00
   63012.863     0.992969       263111       142.22
   63143.935     0.993750       263326       160.00
   63275.007     0.994531       263499       182.86
   63504.383     0.995313       263733       213.33
   63700.991     0.996094       263932       256.00
   63799.295     0.996484       264021       284.44
   63930.367     0.996875       264158       320.00
   63995.903     0.997266       264246       365.71
   64094.207     0.997656       264330       426.67
   64225.279     0.998047       264437       512.00
   64290.815     0.998242       264489       568.89
   64356.351     0.998437       264543       640.00
   64454.655     0.998633       264589       731.43
   64585.727     0.998828       264639       853.33
   64716.799     0.999023       264688      1024.00
   64782.335     0.999121       264741      1137.78
   64782.335     0.999219       264741      1280.00
   64847.871     0.999316       264769      1462.86
   64913.407     0.999414       264794      1706.67
   65011.711     0.999512       264823      2048.00
   65044.479     0.999561       264836      2275.56
   65077.247     0.999609       264848      2560.00
   65110.015     0.999658       264855      2925.71
   65175.551     0.999707       264871      3413.33
   65241.087     0.999756       264886      4096.00
   65241.087     0.999780       264886      4551.11
   65306.623     0.999805       264896      5120.00
   65372.159     0.999829       264905      5851.43
   65404.927     0.999854       264907      6826.67
   65503.231     0.999878       264914      8192.00
   65535.999     0.999890       264921      9102.22
   65535.999     0.999902       264921     10240.00
   65568.767     0.999915       264923     11702.86
   65667.071     0.999927       264925     13653.33
   65765.375     0.999939       264930     16384.00
   65765.375     0.999945       264930     18204.44
   65929.215     0.999951       264933     20480.00
   65929.215     0.999957       264933     23405.71
   66060.287     0.999963       264935     27306.67
   66093.055     0.999969       264936     32768.00
   66191.359     0.999973       264938     36408.89
   66191.359     0.999976       264938     40960.00
   66256.895     0.999979       264940     46811.43
   66256.895     0.999982       264940     54613.33
   66256.895     0.999985       264940     65536.00
   66289.663     0.999986       264942     72817.78
   66289.663     0.999988       264942     81920.00
   66289.663     0.999989       264942     93622.86
   66289.663     0.999991       264942    109226.67
   66289.663     0.999992       264942    131072.00
   66322.431     0.999993       264943    145635.56
   66322.431     0.999994       264943    163840.00
   66322.431     0.999995       264943    187245.71
   66322.431     0.999995       264943    218453.33
   66322.431     0.999996       264943    262144.00
   66355.199     0.999997       264944    291271.11
   66355.199     1.000000       264944          inf
#[Mean    =    33740.883, StdDeviation   =    16570.773]
#[Max     =    66322.432, Total count    =       264944]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  288689 requests in 2.00m, 95.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 42
Requests/sec:   2405.59  
Transfer/sec:    814.72KB